# 1.Напишите программу, которая принимает на вход 
# вещественное число и показывает сумму его цифр.
# Пример:
# - 6782 -> 23
# - 0,56 -> 11

# N=int(input("Введите число:"))
# sum=0
# while N!=0:
#     i=N%10
#     sum+=i
#     N=N//10
# print (sum)


# 2. Напишите программу, которая принимает на вход число N и
#  выдает набор произведений чисел от 1 до N.
# Пример: пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)

# N = int (input('Введите число N: '))
# fact = 1
# for i in range(1,N):
#     fact *= i
#     print(f'{fact}', end = ', ')
# print(fact*N)





